{"_index":"notes","_type":"note","_id":"1510243574011","_score":1,"_source":{"title":"NAPS-41 - Solving PIM access","content":"Q: Ok, got it, thanks. Can you help me understand why it would take 2-4 hours to increase server time out? And what would be the new time out time?\nAlso, I would have thought this is the kind of solution that would have been included in the initial estimate and task to solve PIM access. It's ok for now, but in the future, please let me know if an estimate doesn't include a full resolution of an issue.\n\nA: At that time, we could not know for sure about all the Pimcore access issues. We had high-loaded cron commands (due to execution in parallel and processes queue) and the server was so loaded that I could not even connect with ssh. Right now it works but sometimes the error on Pim-Website could be happened (during some commands execution or selecting data by Website update commands).\nRegarding server timeout: we could to set configurations and restart it; and also be sure that it works correctly. I mean, we have to set the server timeout to 1-2 min (instead of 30 sec) and restart and test it.","createdAt":1510243574011,"updatedAd":1510243574011}}
{"_index":"notes","_type":"note","_id":"1510588431401","_score":1,"_source":{"title":"Allow user profiles to show all community contributions (Polls Votes, Questions, Recommendations)","content":"Q: The only difference between what a user profile displays and what the public can view of that user is that Poll and Questions are public and Votes and Recommendations are not public? \nPerhaps I’m missing something, but if a user profile already contains that data and route, isn’t it a matter of enabling the public to see that data?\nThat data meaning Votes and Recommendations (since Polls and Questions are already public)\n\nA: Yes. There are no pages for displaying other user's Votes and Recommendations Answers. Currently, there are selecting data for current (authorized) user. We can create routed for selecting data by user id (for example '/account/questions-comments/{user_id}' as well as currently '/account/polls/{user_id}') and make some rework on backend (it's almost implemented), but we have to implement view logic for those pages.","createdAt":1510588431401,"updatedAd":1510588431401}}
{"_index":"notes","_type":"note","_id":"1510237246213","_score":1,"_source":{"title":"Pimcore Elasticsearch: Correct import commands > I think so. If we don't do this, does this mean that even if we have products in PIM and website, they would not be searchable (if they're not in ES)? ","content":"Yes. The products which are not inserted into ES are not being processed by \"products:update:category:text\" command, for example. Some products are being inserted into Pimcore's ES during commands executing, but there are less products into Elasticsearch than into DB.","createdAt":1510237246213,"updatedAd":1510237246213}}
{"_index":"notes","_type":"note","_id":"1510070520429","_score":1,"_source":{"title":"Таски из таблицы, которые будут или были (настройка, запуск команд) на Live-е (Pimcore).","content":"https://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-21\n\nhttps://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-32\nhttps://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-33\nhttps://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-34\nhttps://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-36\nhttps://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-37\nhttps://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-38\nhttps://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-41\nhttps://2naps-ddi.atlassian.net/projects/NAPS/issues/NAPS-42","createdAt":1510070520429,"updatedAd":1510070520429}}
{"_index":"notes","_type":"note","_id":"1510063346935","_score":1,"_source":{"title":"Keywords","content":"There are about 47K Not empty keywords for Amazon (it is actually selects \"other_short\" keywords) and 401 for CJ: http://joxi.ru/YmEggw9fZ6J8bA .","createdAt":1510063346935,"updatedAd":1510063346935}}
{"_index":"notes","_type":"note","_id":"1510305978558","_score":1,"_source":{"title":"NAPS-47 - Community page product recs and poll options","content":"Pushed on live. Example: http://joxi.ru/1A5LL8XCKEqlG2 ; http://joxi.ru/VrwyykbHKdleg2","createdAt":1510305978558,"updatedAd":1510305978558}}
{"_index":"notes","_type":"note","_id":"1510054473260","_score":1,"_source":{"title":"Website commands","content":"There was error on execution commands on website (due to permissions and command kernel configurations; I mean the commands could not be executed by Website-cron): http://joxi.net/xAeyy4vHYeBkzA .\nIt has been fixed and the commands are being executed correctly: http://joxi.ru/l2ZKKwls8Z34xA . New products are being imported: http://joxi.ru/E2p33aBiBe6w1m .","createdAt":1510054473260,"updatedAd":1510054473260}}
{"_index":"notes","_type":"note","_id":"1510133647271","_score":1,"_source":{"title":"NAPS-46 Elasticsearch > Accuracy/sorting","content":"Fixed fuzzy searching. Deployed on staging","createdAt":1510133647271,"updatedAd":1510133647271}}
{"_index":"notes","_type":"note","_id":"1510759598970","_score":1,"_source":{"title":"NAPS-53 - Allow admin to see all contributions","content":"Q: \"Could you please fix the following? Admin can't see all recommendation answers (cut off). Also can't see votes.\"\nA: All answered recommendations (as well as commented and voted polls) displaying on the user page in admin ( http://joxi.ru/E2p33aBiBJQ9om ). Sorry, does it display incorrect? How is it being cut off?","createdAt":1510759598970,"updatedAd":1510759598970}}
{"_index":"notes","_type":"note","_id":"1510822744679","_score":1,"_source":{"title":"NAPS-53 - Allow admin to see all contributions","content":"Q: For recommendations, can't see the recommendation \nQ: For votes - admin can't see the person's vote (which product user voted for)\nA: Got it.\nFor recommendations, should it be something like http://joxi.ru/KAg55wPfg3dkkm , right?\nRegarding polls. Can we display all votes (for all users) on poll page: http://joxi.ru/a2XllwKUyKYV32 ? I mean display new table with users votes below products:\nuser1 - voted product1\nuser2 - voted product2\n...","createdAt":1510822744679,"updatedAd":1510822744679}}
{"_index":"notes","_type":"note","_id":"1510904755785","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"\"Server connection error from transfer\" is being happened due to connection error or server loading.\nThis is not data handling error, but request.\nAlso, I tried to test the products matching with example URLs and one of products does not found: http://joxi.ru/4AkLLW8CMBOggr ; http://joxi.ru/Dr8aaq4HkYe0Om . Has the products been merged?","createdAt":1510904755785,"updatedAd":1510904755785}}
{"_index":"notes","_type":"note","_id":"1510906191339","_score":1,"_source":{"title":"Admin accounts","content":"Q: I tried changing it again to the same password and again it's working on main 2naps but not for admin.\nA: Regarding admin password.\nTo be honest, I think this is impossible based on the algorithm and the password field for the user.\nThere are several accounts with similar email: \"angela.choe@gmail.com\", \"angelachoe@gmail.com\", \"angel.a.choe@gmail.com\" etc. Which account do you use for admin? The admin role was set for \"angelachoe@gmail.com\" account. I'he set the admin role also for \"angela.choe@gmail.com\" account.","createdAt":1510906191339,"updatedAd":1510906191339}}
{"_index":"notes","_type":"note","_id":"1511252927562","_score":1,"_source":{"title":"NAPS-45 - Community page searching","content":"There was not all the socials products in ES: http://joxi.ru/Q2KggwLf9R3OQ2\nFor example, on staging (there are more products): http://joxi.ru/ZrJBBwdi1gRkkr \nI've updated socials in ES ( http://joxi.ru/brRggwQfQ1M8am ) and it has been fixed for live: http://joxi.ru/DrlKKdbs4E5noA ; http://joxi.ru/Y2LllwKUngOep2 .\nSocials should be being updating correctly in future, it was deployment issue.","createdAt":1511252927562,"updatedAd":1511252927562}}
{"_index":"notes","_type":"note","_id":"1510754449033","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"I've explored this and found out that the URL-format cannot be handled.\nI mean that actually Pimcore expects Products IDs for finding them in DB/ES. URL has product ID (at the end) and this value should be selected, but there is no implementation for this.\n\nExample.\nSelect Product ID: http://joxi.ru/Q2KggwLf9G8g42 and fill the form: http://joxi.ru/D2Pggw3fd4b1pm\nAfter submitting the form products will be found correctly http://joxi.ru/eAOEEwRh4qgElm - by ID\nAnd then (Bug at this step, no implementation for URL-format handling), the products are being selected and website sending their PimID and they are being merged correctly: http://joxi.ru/V2V66wdU0LnYE2\nResult: 1-st product: http://joxi.ru/J2bxxwDt4LayGr ; 2-nd product not found (merged): http://joxi.ru/DmBgg9zfN1o1w2\n\nWe can implement the URL-format handling. It will take about 1-2 h.\n","createdAt":1510754449033,"updatedAd":1510754449033}}
{"_index":"notes","_type":"note","_id":"1510670179005","_score":1,"_source":{"title":"NAPS-52 - Correct import commands","content":"Products in Pimcore ES: 958549 - http://joxi.ru/DmBgg9zfN1ZlM2\nProducts in DB: 959382 - http://joxi.ru/D2Pggw3fd4zPZm\n\nAfter executions of importing commands there are:\n* products in ES: 958563 - http://joxi.ru/KAg55wPfg3bpkm\n  products in DB:  959396 - http://joxi.ru/Y2LllwKUnVJKR2\n  958563 - 958549 = 14;\n  959396 - 959382 = 14;\n* products in ES: 958569\n  products in DB: 959402\n  http://joxi.ru/4AkLLW8CMBnVQr \n  959402 - 959396 = 6;\n  958569 - 958563 = 6;\n\nThe products are being updated in ES correctly. When the command updates product, it emit the event and Pimcore automatically updates this product in ES.\nSeems, that there are less products in ES (959402 - 958569 = 833), because when we executed the \"products:update:elasticsearch\" command, import items commands were being executed and some products had not inserted to ES.","createdAt":1510670179005,"updatedAd":1510670179005}}
{"_index":"notes","_type":"note","_id":"1510309911990","_score":1,"_source":{"title":"2017-11-10 - daily report","content":"1. Pushing on live:\n    - \"Community page product recs and poll options\" and \"Elasticsearch\" (NAPS-46; NAPS-47)\n\n2. Allow users to use capital letters for products (NAPS-50):\n    - feature implemented;\n    - deployed on staging, tested;\n    - fixed creation answers product (algorithm).\n\n3. Community page bugs after pushing to live (NAPS-51):\n    - fixed updating last activity for recommendations;\n    - pushed to staging.\n\n4. Solving PIM access (NAPS-41):\n    - increasing request timeout to 300 seconds (nginx; ajax); tested.","createdAt":1510309911990,"updatedAd":1510309911990}}
{"_index":"notes","_type":"note","_id":"1510846879493","_score":1,"_source":{"title":"Daily report - 2017-11-16","content":"1. NAPS-53 - Allow admin to see all contributions by users:\n    - poll votes and recommendation answers comments - correctly displaying for admin;\n    - pushed on live.\n\n2. NAPS-54 - Product matching:\n    - implemented the URL-format handling;\n    - pushed on live.\n\nTomorrow I'm going to work on NAPS-55 (\"Look up script\" bug).","createdAt":1510846879493,"updatedAd":1510846879493}}
{"_index":"notes","_type":"note","_id":"1510063529690","_score":1,"_source":{"title":"Pushing on live","content":"Deployed and tested. Works correctly.","createdAt":1510063529690,"updatedAd":1510063529690}}
{"_index":"notes","_type":"note","_id":"1510070688881","_score":1,"_source":{"title":"Some","content":"Test","createdAt":1510070688881,"updatedAd":1510070688881}}
{"_index":"notes","_type":"note","_id":"1510669197114","_score":1,"_source":{"title":"test","content":"123","createdAt":1510669197114,"updatedAd":1510669197114}}
{"_index":"notes","_type":"note","_id":"1510070698472","_score":1,"_source":{"title":"321","content":"321","createdAt":1510070698472,"updatedAd":1510070698472}}
{"_index":"notes","_type":"note","_id":"1510070732378","_score":1,"_source":{"title":"---------","content":"--------------","createdAt":1510070732378,"updatedAd":1510070732378}}
{"_index":"notes","_type":"note","_id":"1510848032614","_score":1,"_source":{"title":"Admin accounts","content":"Q: For some reason my password for admin account is not working. Neither Alan’s nor mine\n\nA: There is correctly data in Database.\nAccounts are active: http://joxi.ru/Dr8aaq4HkYBvJm\nAdmin role is assigned both: http://joxi.ru/E2p33aBiBJgxem ; http://joxi.ru/Dr8aaq4HkYBpJm\nDo you have an error message on login?","createdAt":1510848032614,"updatedAd":1510848032614}}
{"_index":"notes","_type":"note","_id":"1510850997023","_score":1,"_source":{"title":"Admin accounts","content":"As we discussed, you've logged in with old password, right?\nWe have only one password field in database and it's not possible to have two passwords variations.\nPlease, can you try old/new password on client website and/or change it again (to the same one)?\nI have changed my password twice and it's working correctly for both admin and client login.\nPlease, let me know the results. Thank you.","createdAt":1510850997023,"updatedAd":1510850997023}}
{"_index":"notes","_type":"note","_id":"1510921670712","_score":1,"_source":{"title":"NAPS-55 - Look up script","content":"Q: Does this mean that it takes more than 12-24 hours to unpublish products from website? How long does the look up script run from 11 pm?\nA: Lookup script is being running only ones a day and due to that, we have to wait until it's processing all the products on Website. The script processes about 1000 products per minute. There are about 250K products, so script takes about 250 min (4-5 hours).","createdAt":1510921670712,"updatedAd":1510921670712}}
{"_index":"notes","_type":"note","_id":"1510922363492","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"Regarding server optimization. Sure, I think that we have to make optimization and mainly on Pimcore. Likely, this error happened due to Pimcore response.\n\nOk. Let me know the results of login to admin, please.\n\nAs far as I understand, merged products should be removed (disappeared) from website.\nIn other words, we leave only one product from list of products on merging, other products are being deleted from website's DB.","createdAt":1510922363492,"updatedAd":1510922363492}}
{"_index":"notes","_type":"note","_id":"1510923921010","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"Q: Ok. Let me know exactly what we need to do to make product matching happen correctly and the estimate. Merged products should be removed but the merged product should be actually part of the first product. I'll send you example from staging website where it worked correctly.\nA: Thanks. I can only base on code, it's will be great if you explain it.","createdAt":1510923921010,"updatedAd":1510923921010}}
{"_index":"notes","_type":"note","_id":"1510930111497","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"Got it. Thank you.\nYou are right: the reason is that firstly items are being deleted from website and then the request is being sent to Pimcore.\nI think, we have to replace order and firstly make Pim-request. And in the case of a successful request, delete and update the product on website.","createdAt":1510930111497,"updatedAd":1510930111497}}
{"_index":"notes","_type":"note","_id":"1511166841224","_score":1,"_source":{"title":"NAPS-54 - Product matching > algorithm (commands order)","content":"It's done and pushed to Live.\nTesting (products from Jira):\n- merging 3 products: http://joxi.ru/n2YLLwZCjO75Om , http://joxi.ru/5md11DvTv5apl2 , http://joxi.ru/8AnaaKpHqVoRO2 ;\n- http://joxi.ru/52aXXwvtGngZom ;\n- http://joxi.ru/MAjdd6bUvG1L1m ;\n- http://joxi.ru/VrwyykbHKzjXb2 ;\n- the products has been merged: http://joxi.ru/a2XllwKUydlgD2 , http://joxi.ru/D2Pggw3fdxB69m , http://joxi.ru/DrlKKdbs4EGxlA .","createdAt":1511166841224,"updatedAd":1511166841224}}
{"_index":"notes","_type":"note","_id":"1511773839017","_score":1,"_source":{"title":"NAPS-34 - Test new cron","content":"Q: Alex, it seems that some retailers' products (especially Rakuten Popshops) are not updating, as the numbers of items have been static for days. Can you please check whether the scripts are executing correctly and completely? Thanks.\nA: The products which are being imported from retailers platform have images (pictures URLs). There are feature for checking images by requesting them from retailers platform and sometimes this request takes a lot of time. The command should be waiting for response.\nWe can set the request timeout, for example, 5 sec and if there is no response - skip this image url. Usually, this is the optimal timeout value for similar request.","createdAt":1511773839017,"updatedAd":1511773839017}}
{"_index":"notes","_type":"note","_id":"1510070722785","_score":1,"_source":{"title":"111","content":"111","createdAt":1510070722785,"updatedAd":1510070722785}}
{"_index":"notes","_type":"note","_id":"1510071414192","_score":1,"_source":{"title":"\"Got it. Are you looking into the elastic search issue?\"","content":"I'm working on it right now. \nSome new products are being imported to ES: http://joxi.ru/Vm6KKN9sxq5o82 .","createdAt":1510071414192,"updatedAd":1510071414192}}
{"_index":"notes","_type":"note","_id":"1510155189842","_score":1,"_source":{"title":"Pimcore access issue.\nDo we need to do both or would the first (increasing server time) work by itself to solve this issue? Do we need to optimize MySQL for any other issue or just for this issue?","content":"If we increase server time-out we can solve the issue, but in this case for loading (sometimes) we'll have to wait a lot of time for fetching the records from DB. Also, a lot of requests can lead to a high load on the server (I mean, requests from several clients at the same time).\nDB optimization is a complex multi-optimization criteria issue. I need to investigate it before, and then I suggest some solutions. BY this way we can control some processes such as increasing priorities of operations from DB (for example, selecting Pimcore Objects), query caching etc.\nI think, we have to make correctly consumption of server resources, and first of all it's database optimization, because directly DB processes take a lot of server (machine memory/CPU) resources: http://joxi.ru/Y2LllwKUnG5PG2 .\n\n---------\n(consequently, this issue can take more time).\n\nIn any case, Pimcore is working better now, isn't it? We can increase server timeout to ensure that the objects will be fetched from DB and sent to client.","createdAt":1510155189842,"updatedAd":1510155189842}}
{"_index":"notes","_type":"note","_id":"1510238202269","_score":1,"_source":{"title":"Allow user profiles to show all community contributions (Polls Votes, Questions, Recommendations) - now, only polls and questions can be seen by other users and the others are hidden). This is likely simply not hiding votes and recommendations, which are hidden now. ","content":"Q: They're already displayed on user profile page, so nothing needs to be changed there, I think. I didn't realize this is a complex task. What would be the estimate if we just allow admin to see the user's contributions (all constributions)? \n\nA: The pages are implemented on user own profile; but there are no implementation of displaying this pages for other users/guests. I mean, we don't need to make a lot of changes on frontend, but we have to implement this pages on backend (selecting data for specific user etc.). We can display use contributions for admin (for example, below on user page: http://joxi.ru/p27ZZJbC0pBZpm ). It will take about 3-5 hours.","createdAt":1510238202269,"updatedAd":1510238202269}}
{"_index":"notes","_type":"note","_id":"1510304528847","_score":1,"_source":{"title":"NAPS-41 - Solving PIM access","content":"Q: But this will definitely solve the issue, right?\n\nA: The Pimcore Website requests the items from server and waits for response during 30 sec. The error happens when the server could not send response in time.\nIn case of we increase time-out we're only giving the server more time.\nBy this way, we only increase the client (Website) waiting time for getting objects from DB.","createdAt":1510304528847,"updatedAd":1510304528847}}
{"_index":"notes","_type":"note","_id":"1510306404828","_score":1,"_source":{"title":"NAPS-46 - Elasticsearch","content":"Pushed on live.\nhttp://joxi.ru/8AnaaKpHqxZde2\nhttp://joxi.ru/12MggwZf4GVNVr","createdAt":1510306404828,"updatedAd":1510306404828}}
{"_index":"notes","_type":"note","_id":"1510737610208","_score":1,"_source":{"title":"Daily report - 2017-11-14","content":"1. Allow admin to see all contributions by users:\n    - user contributions displayed on user page (admin);\n    - deployed on staging.\n\n2. SEO: Automate title tag and meta description:\n    - \"Title tag and meta descriptions are not showing up correctly\" - checking titles and meta descriptions: apparently, Google has not been indexed the pages.\n\n3. Correct import commands:\n    - testing the products updates in ES and DB.\n\n4. Product matching:\n    - exploring the bug.\n\nTomorrow I am going to continue working on those tasks: testing the products updates in ES and DB (when products will have been imported by the commands); checking title tag and meta description and fixing the \"Product matching\" bug.","createdAt":1510737610208,"updatedAd":1510737610208}}
{"_index":"notes","_type":"note","_id":"1510743138988","_score":1,"_source":{"title":"NAPS-52 - Correct import commands","content":"* products in ES: 960109\n  products in DB: 960942\n  http://joxi.ru/bmoRRl0UMELy7r\n  960942 - 959402 = 1540 (DB);\n  960109 - 958569 = 1540 (ES);\n\n* products in ES: 960110\n  products in DB: 960943\n  http://joxi.ru/RmzBB7biWJzVZm\n  960943 - 960942 = 1 (DB);\n  960110 - 960109 = 1 (ES);\n\nSo, the products are being imported/updated correctly both ES and DB.\nWhen the command updates product, it emit the event and Pimcore automatically updates this product in ES.\n\nSeems, that there are less products in ES (960943 - 960110 = 833), because when we executed the \"products:update:elasticsearch\" command, import items commands were being executed and some (new) products had not inserted to ES.\n\nBecause of \"products:update:elasticsearch\" command removes all products from ES and insert them again.\nSo, for adding those (833) products we can:\n- execute \"products:update:elasticsearch\" command with stopped other commands (2-3 h);\n- or rework \"products:update:elasticsearch\" also for updating products (not only creation, this will solve the same issue in future) (3-6 h).\n\nAlso, all commands are being executed correctly and saved those states: http://joxi.ru/v29RRgXUGknkgA .","createdAt":1510743138988,"updatedAd":1510743138988}}
{"_index":"notes","_type":"note","_id":"1510906864695","_score":1,"_source":{"title":"NAPS-54 - Look up script ","content":"The example products has been deleted from website ( http://joxi.ru/L2155kXf6ZYPz2 ; http://joxi.ru/GrqllRvUNJgX8A ; http://joxi.ru/MAjdd6bUvXe0Gm ).\nHow much time has this process been taking (I mean, deleting products from website)?\n\"Brune Evaporative Humidifier in Charcoal\n\" ( http://2naps.com/product/health-and-safety/humidifiers-and-air-purifiers/brune-evaporative-humidifier-in-charcoal-736760 ; http://joxi.ru/gmv11xbTxJk1Pr ) exists on pimcore: http://joxi.ru/KAxpp1bT4ByK6A . It is published and has correct price: http://joxi.ru/KAxpp1bT4Byv6A .","createdAt":1510906864695,"updatedAd":1510906864695}}
{"_index":"notes","_type":"note","_id":"1510063344079","_score":1,"_source":{"title":"Solving PIM access","content":"Commands are being executed correctly: threre are executed only \"import:items:ra\" command and it does not take a lot of resources ( http://joxi.ru/nAyppybTXNb352 ; http://joxi.ru/KAg55wPfgk79Dm ). RP import command: http://joxi.ru/bmoRRl0UM0dv0r ; http://joxi.ru/1A5LL8XCKEJy32 .\nIn this case, there is database issue.\nA lot of resources are being loaded by MySQL (database) processes: http://joxi.ru/52aXXwvtGxeWVm ; http://joxi.ru/p27ZZJbC0p891m . Also, there were MySQL errors: http://joxi.ru/L2155kXf6qaq92 ; http://joxi.ru/Q2KggwLf9aqGE2 .\nThere are also happened server timeout error: http://joxi.ru/EA4ddlXUDqMG0A .\nWhen mysql service has been restarted ( http://joxi.ru/Y2LllwKUnGqOM2 ) Pimcore has been working right ( http://joxi.ru/4AkLLW8CMelber ); MySQL processlist: http://joxi.ru/MAjdd6bUv7owzm .\n\nActually the error on Pimcore admin-website happens due to server timeout, when the database is handling a process (processes) and it cannot send the response in time.\n\nSo, for solve this issue, I think, we have the next ways:\n- increace the server timeout (right now it set at 30 sec; default value): but it contributes to long-term waiting and height server loading (this issue will take about 2-4 hours);\n- make MySQL/php-fpm (FastCGI Process Manager) optimization and allocate more resources, queries caching, also, we can lower the priority of INSERT / UPDATE operations in comparison with SELECT: this can affect to commands processes (for example, insert/update) but increase the speed of Pimcore's loading (for exclude the error on timeout); this can takes about 6-10 hours.","createdAt":1510063344079,"updatedAd":1510063344079}}
{"_index":"notes","_type":"note","_id":"1510585917142","_score":1,"_source":{"title":"Allow user profiles to show all community contributions (Polls Votes, Questions, Recommendations)","content":"A: Actually, there are no implementation of this feature. I've noticed that it was envisaged and we can use parts of current views, but we still have to implement this pages for specific user.\n\nQ: Ok got it, then let’s just implement it for admin for now (3-6 hrs)\n\nA: Ok. Perhaps, this code has not been pushed to repository. I mean, there is feature for selecting data, but there are no routes, data for views (such as \"Votes\"/\"Answers\" button of sidebar) etc.\n","createdAt":1510585917142,"updatedAd":1510585917142}}
{"_index":"notes","_type":"note","_id":"1510306710133","_score":1,"_source":{"title":"NAPS-41 - Solving PIM access","content":"We cannot guarantee that the server will respond during 30 sec or 2 min. But if it has more time for response, it reduces the error probability.\nI suggest to set it to 300 sec (5 min); having explored this issue, I found out that often do so.","createdAt":1510306710133,"updatedAd":1510306710133}}
{"_index":"notes","_type":"note","_id":"1510567492174","_score":1,"_source":{"title":"NAPS-48; NAPS-49; NAPS-50; NAPS-51: Pushing to live","content":"* SEO: Automate title tag and meta description generation for community page polls and recommendations\n* Recommendation answer and comment box\n* Allow users to use capital letters for products\n* Community page bugs after pushing to live","createdAt":1510567492174,"updatedAd":1510567492174}}
{"_index":"notes","_type":"note","_id":"1510129673616","_score":1,"_source":{"title":"6. Allow user profiles to show all community contributions (Polls Votes, Questions, Recommendations) - now, only polls and questions can be seen by other users and the others are hidden). This is likely simply not hiding votes and recommendations, which are hidden now","content":"Got it ( http://joxi.ru/a2XllwKUyL37j2 ). So, the Polls, Votes, Questions, Recommendations should be displayed as well as on user own profile page ( http://joxi.ru/BA0QQx1FBoY9qr ), right?","createdAt":1510129673616,"updatedAd":1510129673616}}
{"_index":"notes","_type":"note","_id":"1510678133583","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"Pimcore's response: http://joxi.ru/VrwyykbHKJ3e82\nActually, this format (string response) is not being handled on website. And it displays the message: \"Error format\" ( http://joxi.ru/52aXXwvtGdqzqm ).\n\nPerhaps, there is incorrect data format in form (or incorrect handling the request data) on website. As result, website sending empty products in the request to Pimcore.","createdAt":1510678133583,"updatedAd":1510678133583}}
{"_index":"notes","_type":"note","_id":"1510129250625","_score":1,"_source":{"title":"4. Recommendation answer and comment box","content":"So, you mean that we have to make responsive textarea height, right?","createdAt":1510129250625,"updatedAd":1510129250625}}
{"_index":"notes","_type":"note","_id":"1510050496865","_score":1,"_source":{"title":"Constants","content":"A constant is an identifier (name) for a simple value. As the name suggests, that value cannot change during the execution of the script (except for magic constants, which aren't actually constants). A constant is case-sensitive by default. By convention, constant identifiers are always uppercase.","createdAt":1510050496865,"updatedAd":1510050496865}}
{"_index":"notes","_type":"note","_id":"1510135411613","_score":1,"_source":{"title":"Meta descriptions for polls","content":"Meta descriptions for polls (“Compare” plus the product names): http://joxi.ru/xAeyy4vHYe17bA ; http://joxi.ru/nAyppybTXNBVq2 .\nFor example, the meta description length for last example is 154 ( http://joxi.ru/p27ZZJbC0pRvlm ). I think it is correct, right?","createdAt":1510135411613,"updatedAd":1510135411613}}
{"_index":"notes","_type":"note","_id":"1511252384641","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"Testing matching products:\nhttp://joxi.ru/zANMMwaflgXvV2\nhttp://joxi.ru/4AkLLW8CMGbonr\nGot the error:\nhttp://joxi.ru/gmv11xbTxz8NNr\nProducts has not been deleted from Website:\nhttp://joxi.ru/ZrJBBwdi1gRwxr\nhttp://joxi.ru/LmGggw5fRLKwPm","createdAt":1511252384641,"updatedAd":1511252384641}}
{"_index":"notes","_type":"note","_id":"1511253973057","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"We've fixed the algorithm on website: the products are not being deleted on request error.\nTesting matching products:\nhttp://joxi.ru/zANMMwaflgXvV2\nhttp://joxi.ru/4AkLLW8CMGbonr\nGot an error:\nhttp://joxi.ru/gmv11xbTxz8NNr\nProducts has not been deleted from Website:\nhttp://joxi.ru/ZrJBBwdi1gRwxr\nhttp://joxi.ru/LmGggw5fRLKwPm\n\nIn this case, there is `500 Internal Server Error` on Pimcore: http://joxi.ru/Y2LllwKUngOOg2\nSeems that there is an error of matching products on Pimcore. For example, more than 3 products. I think, this is Pimcore's code issue.","createdAt":1511253973057,"updatedAd":1511253973057}}
{"_index":"notes","_type":"note","_id":"1511345508071","_score":1,"_source":{"title":"NAPS-54 - Product matching","content":"Perhaps, that's right, but I have not worked on this feature on Pimcore and I need about 1-2 hours to investigate it.","createdAt":1511345508071,"updatedAd":1511345508071}}
{"_index":"notes","_type":"note","_id":"1511775331328","_score":1,"_source":{"title":"NAPS-56 - Community page front end bugs","content":"I have no errors of popups:\n  - \"Welcome\" (overview) popup: http://joxi.ru/MAjdd6bUvKkyzm\n  - Sign up popup: http://joxi.ru/DmBgg9zfNZ4Dj2\n\nRegarding loader: there was an error due to textarea resizing (error only for IE). It have been fixed. Pushed to staging.","createdAt":1511775331328,"updatedAd":1511775331328}}
{"_index":"notes","_type":"note","_id":"1510324601766","_score":1,"_source":{"title":"NAPS-41 - Solving PIM access > increasing request timeout","content":"Actually, we can set a big value of waiting time, but if a lot of requests sending to server, it can being overloaded. We should not set to big value of timeout.\nMost sources advise exactly this value (x10). Usually requests take about 10-15 sec ( http://joxi.ru/brRggwQfQdyblm ; http://joxi.ru/KAg55wPfg3nB4m ; http://joxi.ru/VrwyykbHKJVMM2 ).\n\nIncreasing request timeout: http://joxi.ru/p27ZZJbC0pQOWm\nNginx conf: http://joxi.ru/E2p33aBiBedKQm ; http://joxi.ru/l2ZKKwls8Z66RA \nphp conf: http://joxi.ru/ZrJBBwdi1033lr ; http://joxi.ru/EA4ddlXUDGPDvA\nTesting (Lookup command is not being executed; route does not being used):\n - http://joxi.ru/xAeyy4vHYaJR8A - request timeout when server loading more then 300s (I'he emit server loading);\n - http://joxi.ru/BA0QQx1FBKlvXr - request timeout when server loading about 200s.\n\nAlso, I'he found out that there are timeout of ajax-requests (from client JS). \nI've also increased the AJAX-timeout: http://joxi.ru/brRggwQfQdQJYm ; http://joxi.ru/KAxpp1bT4B41GA ; http://joxi.ru/DrlKKdbs4k4yjA .\n\nSo, in case of server is sending response during 300 seconds (5 min) - the error should not happen.","createdAt":1510324601766,"updatedAd":1510324601766}}
{"_index":"notes","_type":"note","_id":"1510653254784","_score":1,"_source":{"title":"NAPS-48 - SEO: Automate title tag and meta description generation for community page polls and recommendations","content":"http://joxi.ru/BA0QQx1FBKo8Vr - задано правильно\nhttp://joxi.ru/EA4ddlXUDGq55A - то, как отображает гугл\nhttp://joxi.ru/8AnaaKpHqgx9Z2 - взял, похоже, отсюда","createdAt":1510653254784,"updatedAd":1510653254784}}
{"_index":"notes","_type":"note","_id":"1510662197394","_score":1,"_source":{"title":"NAPS-48 - SEO: Automate title tag and meta description generation for community page polls and recommendations","content":"Got it. I'm going to explore and fix this.\nTitle and meta description are set correctly: http://joxi.ru/BA0QQx1FBKo8Vr\nBut Google displays this data: http://joxi.ru/EA4ddlXUDGq55A ; http://joxi.ru/8AnaaKpHqgx9Z2\n\n---\n\nApparently, Google has not been indexed the pages: we'he just pushed this task to live. Usually it can take up to several days.\nExamples. Pages has old titles/descriptions: http://joxi.ru/RmzBB7biWJlLDm and http://joxi.ru/4AkLLW8CMBGD8r ; http://joxi.ru/52aXXwvtGdny5m and http://joxi.net/GrqllRvUNJOMpA .","createdAt":1510662197394,"updatedAd":1510662197394}}
{"_index":"notes","_type":"note","_id":"1510135786248","_score":1,"_source":{"title":"Meta description for recommendations","content":"Meta description for recommendations should be “Recommendations for” plus the product names (from answers): http://joxi.ru/ZrJBBwdi1ZOgNr ; http://joxi.ru/krDggvjf05k6YA ; http://joxi.ru/l2ZKKwls8Z530A .\nFor recommendations description, there are more probability that there will be long description, although so far I have not noticed such description. However, in case of there will be a lot of products, some will be excluded from description.","createdAt":1510135786248,"updatedAd":1510135786248}}
{"_index":"notes","_type":"note","_id":"1510135306528","_score":1,"_source":{"title":"Title tag: 50-60 characters","content":"Title tags for polls and recommendations: http://joxi.ru/RmzBB7biWZz5xm ; http://joxi.ru/Vm6KKN9sxq9zy2 ; http://joxi.net/BA0QQx1FBoaZ8r .","createdAt":1510135306528,"updatedAd":1510135306528}}
{"_index":"notes","_type":"note","_id":"1510240766360","_score":1,"_source":{"title":"NAPS - 49 Recommendation answer and comment box","content":"Implemented responsive textarias; deployed on staging ( http://joxi.ru/82QjjwOC1bOG6A ).","createdAt":1510240766360,"updatedAd":1510240766360}}
{"_index":"notes","_type":"note","_id":"1510144819899","_score":1,"_source":{"title":"Community page > non existent products","content":"Allowed users to create polls options and answers with non existent products.\nImplemented new validation (for not empty fields) and fixed update of poll_vote product keyword on editing by admin.\nExample: http://joxi.ru/xAeyy4vHYeklkA ; http://joxi.ru/brRggwQfQklMym .","createdAt":1510144819899,"updatedAd":1510144819899}}
{"_index":"notes","_type":"note","_id":"1510828183149","_score":1,"_source":{"title":"NAPS-53 - Allow admin to see all contributions","content":"Displaying recommendations answers: http://joxi.ru/BA0QQx1FBKnv5r . How does it looks?","createdAt":1510828183149,"updatedAd":1510828183149}}
{"_index":"notes","_type":"note","_id":"1510070695225","_score":1,"_source":{"title":"123","content":"123","createdAt":1510070695225,"updatedAd":1510070695225}}
{"_index":"notes","_type":"note","_id":"1510930812814","_score":1,"_source":{"title":"NAPS-55 - Look up script","content":"Got it. Maybe it take more time due to longer Pimcore responds sometimes. Perhaps, the request time has over and the product has been skipped.\nHowever, in any case, the product has been deleted (you can follow the link in your comment).\nAlso, we can set this script twice a day: 11 am and 11 pm (instead of only 11 pm: http://joxi.ru/VrwyykbHKJpL12 ), because it has been already executed (8-9 am - server time). The products will be updated on website more often.\n\nAt 11 pm the \"products:update:similar\" command is being executed on Pimcore ( http://joxi.ru/52aXXwvtGdLpOm ). This is height-loaded command and Pimcore can responds longer at that time. So, Lookup script can takes more then 4-5 hour. But it has been completed already.","createdAt":1510930812814,"updatedAd":1510930812814}}
